public_html/mysql-option.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MySQL Option Files</title>
<!-- 2013-05-02 Thu 15:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Neil Best"/>
</head>
<body>
<div id="content">
<h1 class="title">MySQL Option Files</h1>
<p>
You can simplify the process of connecting to the database by using an
option file.
</p>

<p>
Create a file named <code>.my.cnf</code> in your home directory, i.e. <code>~/.my.cnf</code>
and edit it. Add lines of this form:
</p>

<pre class="example">
[client]
host=classdbs
user=neil
database=instructorDB
password=12345
</pre>

<p>
Edit the values to match what you have been entering on the command
line, save the file and run <code>mysql</code> with no options. <i>Voilà!</i> 
</p>

<p>
In many environments it may be a questionable practice to include a
password in a file, but in this situation we can accept this risk. We
are not using are databases to house sensitive data and our accounts
do not have privileges beyond our own databases. Exposure can be
minimized by changing the permissions on the option file if they are
not already set minimally:
</p>

<pre class="example">
chmod u=rw,go= ~/.my.cnf
</pre>

<p>
If you prefer you may leave out the <code>password</code> entry and start the
client with <code>mysql -p</code>.
</p>

<p>
See the output from <code>mysql &#x2013;help</code> or
<a href="http://dev.mysql.com/doc/refman/5.5/en/option-files.html">http://dev.mysql.com/doc/refman/5.5/en/option-files.html</a> for more
information.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Neil Best</p>
<p class="date">Created: 2013-05-02 Thu 15:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.1)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
